Revit 2024 API
RevitAPIEventArgs.Dispose Method
Releases all resources used by the RevitAPIEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace